#-----------------------------------------------------------------------------------------------

 # : العوامل التي تستخدم للتعامل مع البتات

#-----------------------------------------------

# 1- العامل & يحسب ناتج جمع بالتات المشتركة بين قيمتين.

a = 10      # a = 10 = 00000000000000000000000000001010
b = 75      # 7b = 75 = 00000000000000000000000001001011

c = a & b   # شرحنا كيف سيتم الحصول على الناتج تحت نتيجة التشغيل

print(a, '&', b, '=', c)

#-----------------------------------------------

# 2- العامل | يحسب ناتج جمع البتات المشتركة و الغير مشتركة بين قيمتين.

a = 10      # 10 = 00000000000000000000000000001010
b = 75      # 75 = 00000000000000000000000001001011

c = a | b   # شرحنا كيف سيتم الحصول على الناتج تحت نتيجة التشغيل

print(a, '|', b, '=', c)

#-----------------------------------------------

# 3- العامل ^ يحسب ناتج جمع البتات الغير مشتركة بين قيمتين.

a = 10      # 10 = 00000000000000000000000000001010
b = 75      # 75 = 00000000000000000000000001001011

c = a ^ b   # شرحنا كيف سيتم الحصول على الناتج تحت نتيجة التشغيل

print(a, '^', b, '=', c)

#-----------------------------------------------

# 4- العامل ~ يقلب البتات التي تساوي 0 إلى 1 و يقلب <البتات التي تساوي 1 إلى 0.

a = 10     # 10 = 00000000000000000000000000001010
c = ~a     #  c = 11111111111111111111111111110111 = -11

print('~', a, '=', c)

#-----------------------------------------------

# 5- العامل << يمسح بتات من ناحية اليسار ثم يبدل كل بت تم مسحها منهم بصفر و يضعهم من ناحية اليمين.

a = 10       # 10 = 00000000000000000000000000001010
c = a << 2   # شرحنا كيف سيتم الحصول على الناتج تحت نتيجة التشغيل

print(a, '<< 2 =', c)

#-----------------------------------------------

''' 6- العامل >> عندها حالتين: قد يكون العدد أكبر من صفر أو أصغر من صفر.

إذا كان العدد أكبر من صفر، يمسح البتات من ناحية اليمين ثم يبدل كل بت منهم بصفر و يضعهم من ناحية اليسار.
إذا كان العدد أصغر من صفر، يمسح البتات من ناحية اليمين ثم يبدل كل بت منهم بواحد ليحافظ على إشارة الناقص و يضعهم من ناحية اليسار.
'''

a = 9        # 9 = 00000000000000000000000000001001
c = a >> 2   # شرحنا كيف سيتم الحصول على الناتج تحت نتيجة التشغيل

print(a, '>> 2 =', c)

#-----------------------------------------------

#-----------------------------------------------------------------------------------------------

# العوامل التي تستخدم لإعطاء قيم للمتغيرات :

#-----------------------------------------------

# 1- العامل = يستخدم لإعطاء قيمة لمتغير.

a = 10

print('a =', a)

#-----------------------------------------------

# 2- العامل += يستخدم لإضافة قيمة ما على قيمة المتغير بكود أقل.

a = 10
b = 20

a += b   # a = a + b

print('a =', a)

#-----------------------------------------------

# 3- العامل -= يستخدم لطرح قيمة ما من قيمة المتغير بكود أقل.

a = 10
b = 20

a -= b   # a = a - b

print('a =', a)

#-----------------------------------------------

# 4- العامل *= يستخدم لضرب قيمة المتغير بقيمة ما بكود أقل.

a = 10
b = 20

a *= b   # a = a * b

print('a =', a)

#-----------------------------------------------

# 5- العامل ** يستخدم لمضاعفة قيمة بقيمة، أي لضرب قيمة المتغير بنفسها عدة مرات بكود أقل.

a = 2

a **= 5     # a = a ** 5

print('a =', a)

#-----------------------------------------------

# 6- العامل /= يستخدم لقسم قيمة المتغير على قيمة ما بكود أقل.

a = 100
b = 20

a /= b   # a = a / b

print('a =', a)

#-----------------------------------------------

# 7- العامل //= يستخدم لقسم قيمة المتغير على قيمة ما مع تقريب الناتج لأقرب عدد صحيح حتى لا يظهر أي رقم بعد الفاصلة بكود أقل.

a = 8
b = 5

a //= b   # a = a // b

print('a =', a)

#-----------------------------------------------

# 8- العامل %= يستخدم لتخزين الباقي من قسمة قيمة المتغير على قيمة ما بكود أقل.

a = 10
b = 7

a %= b   # a = a % b

print('a =', a)

#-----------------------------------------------

# 9-  العامل <<= يعني إمسح بتات من ناحية اليسار ثم بدل كل بت تم مسحها منهم بصفر و ضعهم من ناحية اليمين ثم ضع الناتج في المتغير من جديد.

a = 10

a >>= 2   # a  =  a >> 2  =  00000000000000000000000000001010 >> 2  =  00000000000000000000000000000010  =  2

print('a =', a)

#-----------------------------------------------

# 10- العامل &= يعني إحسب ناتج جمع البتات المشتركة بين المتغير a و المتغير b ثم خزن الناتج في المتغير a.

a = 10
b = 75

a &= b   # a  =  a & b  =  00000000000000000000000000001010  &  00000000000000000000000001001011  =  00000000000000000000000000001010  =  10

print('a =', a)

#-----------------------------------------------

# 11- العامل |= يعني إحسب ناتج جمع البتات المشتركة و الغير مشتركة بين المتغير a و المتغير b ثم خزن الناتج في المتغير a.

a = 10
b = 75

a |= b   # a  =  a | b  =  00000000000000000000000000001010  |  00000000000000000000000001001011  =  00000000000000000000000001001011  =  75

print('a =', a)

#-----------------------------------------------

# 12- العامل ^= يعني إحسب ناتج جمع البتات الغير مشتركة بين المتغير a و المتغير b ثم خزن الناتج في المتغير a

a = 10
b = 75

a |= b   # a  =  a | b  =  00000000000000000000000000001010 ^ 00000000000000000000000001001011 = 00000000000000000000000001000001 = 65

print('a =', a)

#-----------------------------------------------

#-----------------------------------------------------------------------------------------------

# العوامل التي تستخدم للبحث في المصفوفات

#-----------------------------------------------

# 1- العامل in يستخدم لمعرفة ما إذا كانت المصفوفة تحتوي على قيمة معينة أم لا.

# هنا قمنا بتعريف مصفوفة تتألف من 5 عناصر عبارة عن أرقام صحيحة
numbers = [1, 2, 3, 4, 5]

# y و x هنا قمنا بتعريف متغيران
x = 3
y = 8

# سيتم تنفيذ أمر الطباعة x تحتوي على قيمة المتغير numbers إذا كانت المصفوفة
if x in numbers:
    print('x value exists in the array')

# سيتم تنفيذ أمر الطباعة y تحتوي على قيمة المتغير numbers إذا كانت المصفوفة
if y in numbers:
    print('y value exists in the array')

#-----------------------------------------------

# 2- العامل not in يستخدم لمعرفة ما إذا كانت المصفوفة لا تحتوي على قيمة معينة أم لا.

# هنا قمنا بتعريف مصفوفة تتألف من 5 عناصر عبارة عن أرقام صحيحة
numbers = [1, 2, 3, 4, 5]

# y و x هنا قمنا بتعريف متغيران
x = 3
y = 8

# سيتم تنفيذ أمر الطباعة x لا تحتوي على قيمة المتغير numbers إذا كانت المصفوفة
if x not in numbers:
    print('x value not exists in the array')

# سيتم تنفيذ أمر الطباعة y لا تحتوي على قيمة المتغير numbers إذا كانت المصفوفة
if y not in numbers:
    print('y value not exists in the array')

#-----------------------------------------------

#-----------------------------------------------------------------------------------------------

# العوامل التي تستخدم لمعرفة ما إذا كان الكائنين يشيران لكائن واحد في الذاكرة أم لا : 

# 1- طريقة معرفة عنوان المتغير أو الكائن في الذاكرة :

# لمعرفة المكان أو العنوان المحجوز في الذاكرة لأي شيء تم تعريفه يمكنك إستخدام الدالة id() :

#-----------------------------------------------

# 2- العامل is :
# يستخدم لمعرفة ما إذا كان الكائنين يشيران لكائن واحد في الذاكرة أم لا.

# ذا كانا يشيران لنفس الكائن فإنه يرجع الجواب True.
# إذا كانا لا يشيران لنفس الكائن فإنه يرجع الجواب False.

# هنا قمنا بتعريف مصفوفتين عندهما نفس الحجم و وضعنا فيهما نفس القيم
A = [1, 2, 3]
B = [1, 2, 3]

# في الذاكرة B و A هنا قمنا بطباعة عنوان المصفوفتان
print('A address is:', id(A))
print('B address is:', id(B))

# يشيران لكائن واحد في الذاكرة ( أي لعنوان واحد ) سيتم تنفيذ أمر الطباعة B و A إذا كان
if A is B:
    print('A and B have the same ID')

#-----------------------------------------------

# 3- العامل is not :
# يستخدم لمعرفة ما إذا كان الكائنين لا يشيران لكائن واحد في الذاكرة أم لا.

# هنا قمنا بتعريف مصفوفتين عندهما نفس الحجم و وضعنا فيهما نفس القيم
A = [1, 2, 3]
B = [1, 2, 3]

# في الذاكرة B و A هنا قمنا بطباعة عنوان المصفوفتان
print('A address is:', id(A))
print('B address is:', id(B))

# لا يشيران لكائن واحد في الذاكرة ( أي لعنوان واحد ) سيتم تنفيذ أمر الطباعة B و A إذا كان
if A is not B:
    print('A and B have different IDs')

#-----------------------------------------------

#-----------------------------------------------------------------------------------------------
