#------------------------------------------------------------------------------------------------------------------------------------------------

# الاعداد :

#-------------------------------------------------------------

# دوال تحويل أنواع الأعداد الموجودة :

#-------------------------------------------------------------

# 1- الدالة int(x) :

x = 5.5           # ( float أي ) قيمته عبارة عن عدد عشري x هنا قمنا بتعريف متغير إسمه
y = int(x)        # y ثم وضعناها في متغير جديد إسمه ( int أي ) إلى قيمة صحيحة x هنا قمنا بتحويل قيمة المتغير

print('x =', x)   # x هنا قمنا بعرض قيمة المتغير
print('y =', y)   # y هنا قمنا بعرض قيمة المتغير

#-------------------------------------------------------------

# 2- الدالة int(x, base) :

# base : أي نظام العد .

x = '101'         # ( string أي ) قيمته عبارة عن نص x هنا قمنا بتعريف متغير إسمه
y = int(x, 2)     # y مبنية على الوحدة 2. ثم وضعناها في متغير جديد إسمه x و حددنا أن الـ ( int أي ) إلى قيمة صحيحة x هنا قمنا بتحويل قيمة المتغير

print('x =', x)   # x هنا قمنا بعرض قيمة المتغير
print('y =', y)   # y هنا قمنا بعرض قيمة المتغير

#-------------------------------------------------------------

# 3- الدالة float(x) :

x = '10.5'        # ( float أي ) يمثل عدد عشري ( string أي ) قيمته عبارة عن نص x هنا قمنا بتعريف متغير إسمه
y = float(x)      # y ثم وضعناها في متغير جديد إسمه ( float أي ) إلى قيمة عشرية x هنا قمنا بتحويل قيمة المتغير

print('x =', x)   # x هنا قمنا بعرض قيمة المتغير
print('y =', y)   # y هنا قمنا بعرض قيمة المتغير

#-------------------------------------------------------------

# 4- الدالة complex(real, imag) :

# و 2 مكان real مع إعطائها 1 مكان الباراميتر complex() هنا قمنا باستدعاء الدالة
# x و وضعنا العدد المركب الذي أرجعته بناءاً على هذين العددين في المتغير imag الباراميتر
x = complex(1, 2)

# و التي تمثل عدد مركب x هنا قمنا بعرض قيمة المتغير
print('x =', x)

#-------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------------------------------

# دوال التعامل مع الأعداد الموجودة :

#-------------------------------------------------------------

# 1- الدالة abs() :

# تعريفها: ترجع القيمة المطلقة للعدد الذي نمرره لها مكان الباراميتر .

x = -5                       # -قيمته 5 x هنا قمنا بتعريف متغير إسمه

print('x =', x)              # كما هي x هنا قمنا بعرض قيمة المتغير
print('abs(x) =', abs(x))    # abs() المطلقة التي أرجعتها الدالة x هنا قمنا بعرض قيمة المتغير

#-------------------------------------------------------------

# 2- الدالة round() :

# ترجع أقرب عدد صحيح للعدد الذي نمرره لها مكان الباراميتر number :

x = 5.674                                 # قيمته 5.674 x هنا قمنا بتعريف متغير إسمه

print('round(',x,')    =', round(x))      # x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 1) =', round(x, 1))   # مع تجاهل أي عدد موجود بعد الفاصلة بعدد واحد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 2) =', round(x, 2))   # مع تجاهل أي عدد موجود بعد الفاصلة بعددين x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 3) =', round(x, 3))   # مع تجاهل أي عدد موجود بعد الفاصلة بثلاثة أعداد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة
print('round(',x,', 4) =', round(x, 4))   # مع تجاهل أي عدد موجود بعد الفاصلة بأربعة أعداد x لترجع أقرب قيمة لقيمة المتغير round() هنا قمنا باستدعاء الدالة

#-------------------------------------------------------------

# 3- الدالة max() :

# ترجع العدد الأكبر من بين مجموعة الأعداد التي يتم تمريرها لها عند استدعائها.

# المثال الأول : 

# هنا قمنا بتعريف 3 متغيرات تحتوي على قيم مختلفة
x = 1
y = 7
z = 4

# max بواسطة الدالة z و y ،x هنا قمنا بعرض القيمة الأكبر بين القيم الموجودة في المتغيرات
print('The biggest number is:', max(x, y, z))

# المثال الثاني : 

# ( أي ككائن واحد يحتوي على مجموعة قيم ) iterable هنا قمنا بتعريف مصفوفة من الأعداد و وضعنا قيمها بداخل [] حتى تصبح كـ
iterable =([1, 4, 2, 9, 6, 5])

# iterable هنا قمنا بعرض القيمة الأكبر بين القيم الموجودة في الكائن
print('The biggest number is:', max(iterable))

#-------------------------------------------------------------

# 4- الدالة min() :

# ترجع العدد الأصغر من بين مجموعة الأعداد التي يتم تمريرها لها عند استدعائها.

# المثال الأول : 

# هنا قمنا بتعريف 3 متغيرات تحتوي على قيم مختلفة
x = 7
y = 1
z = 4

# min بواسطة الدالة z و y ,x هنا قمنا بعرض القيمة الأصغر بين القيم الموجودة في المتغيرات
print('The smallest number is:', min(x, y, z))

# المثال الثاني :

# ( أي ككائن واحد يحتوي على مجموعة قيم ) iterable هنا قمنا بتعريف مصفوفة من الأعداد و وضعنا قيمها بداخل [] حتى تصبح كـ
iterable =([1, 4, 2, 9, 6, 5])

# iterable هنا قمنا بعرض القيمة الأصغر بين القيم الموجودة في الكائن
print('The smallest number is:', min(iterable))

#-------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------------------------------

# معنى كلمة Module :
# في بايثون، الموديول ( Module ) هو ملف بايثون عادي يمكنه أن يحتوي على متغيرات، دوال، كلاسات إلخ..

# دوال و ثوابت الموديل math :
#  هو موديل جاهز في بايثون يحتوي على دوال تستخدم في العمليات الحسابية و الهندسية، ذكرنا أهمها في الجدول التاليmath.

# 1- الدالة ceil(x) :
# ترجع العدد الصحيح الأكبر أو الذي يساوي العدد الذي نمرره لها مكان الباراميتر x.

# ceil() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# ceil() هنا قمنا بعرض العدد الصحيح الأكبر أو الذي يساوي 5.0 الذي أرجعته الدالة
print('math.ceil(5.0) =', math.ceil(5.0))

# ceil() هنا قمنا بعرض العدد الصحيح الأكبر أو الذي يساوي 5.3 الذي أرجعته الدالة
print('math.ceil(5.3) =', math.ceil(5.3))

# ceil() هنا قمنا بعرض العدد الصحيح الأكبر أو الذي يساوي 5.7 الذي أرجعته الدالة
print('math.ceil(5.7) =', math.ceil(5.7))

#-------------------------------------------------------------

# 2- لدالة floor(x) :
# ترجع العدد الصحيح الأصغر أو الذي يساوي العدد الذي نمرره لها مكان الباراميتر x.

# floor() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# floor() هنا قمنا بعرض العدد الصحيح الأصغر أو الذي يساوي 5.0 الذي أرجعته الدالة
print('math.floor(5.0) =', math.floor(5.0))

# floor() هنا قمنا بعرض العدد الصحيح الأصغر أو الذي يساوي 5.3 الذي أرجعته الدالة
print('math.floor(5.3) =', math.floor(5.3))

# floor() هنا قمنا بعرض العدد الصحيح الأصغر أو الذي يساوي 5.7 الذي أرجعته الدالة
print('math.floor(5.7) =', math.floor(5.7))

#-------------------------------------------------------------

# 3- الدالة pow(x , y) :
# ترجع ناتج مضاعفة العدد الذي نمرره لها مكان الباراميتر x بالعدد الذي نمرره لها مكان الباراميتر y كعدد عشري نوعه float .

# pow() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# pow() هنا قمنا بعرض ناتج مضاعفة العدد 5 مرتين الذي أرجعته الدالة
print('pow(5, 2) =', math.pow(5, 2))

#-------------------------------------------------------------

# 4- الدالة sqrt(x) :
# ترجع قيمة الجذر التربيعي ( Square Root ) للعدد الذي نمرره لها مكان الباراميتر x .

# sqrt() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# sqrt() هنا قمنا بعرض ناتج الجزر التربيعي للعدد 25 الذي أرجعته الدالة
print('sqrt(25) =', math.sqrt(25))

#-------------------------------------------------------------

# 5- الدالة exp(x) :
# ترجع قيمة المتسارع للعدد الذي نمرره لها مكان الباراميتر x .
# قيمة المتسارع تساوي e**x، أي قيمة e مضاعفة بقيمة x .
# قيمة الحرف e هي 2.718281828459045 و يمكننا الحصول عليها هكذا math.e .

# exp() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# exp() هنا قمنا بعرض قيمة المتسارع للعدد 5 التي أرجعتها الدالة 
print('math.exp(5) =', math.exp(5))

#-------------------------------------------------------------

# 6- الدالة log(x[, base]) :
# ترجع قيمة اللوغارتم للعدد الذي نمرره لها مكان الباراميتر x مع إمكانية تحديد نوع الوحدة لهذا العدد .

# log() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# log() التي أرجعتها الدالة ( e تساوي base للعدد 5 ( مع إعتبار أن الـ Logarithm هنا قمنا بعرض قيمة الـ
print('log(5)     =', math.log(5))

# log() و التي أرجعتها الدالة ( log base e للعدد 5 ( مع تحديد أننا نستخدم Logarithm هنا قمنا بعرض قيمة الـ
print('log(5, e)  =', math.log(5, math.e))

# log() و التي أرجعتها الدالة ( log base 2 للعدد 5 ( مع تحديد أننا نستخدم Logarithm هنا قمنا بعرض قيمة الـ
print('log(5, 2)  =', math.log(5, 2))

# log() و التي أرجعتها الدالة ( log base 10 للعدد 5 ( مع تحديد أننا نستخدم Logarithm هنا قمنا بعرض قيمة الـ
print('log(5, 10) =', math.log(5, 10))

#-------------------------------------------------------------

# 7- الدالة log2(x) :
# ترجع قيمة اللوغارتم الثنائي للعدد الذي نمرره لها مكان الباراميتر x.
# هذه الدالة تعتبر بديل للدالة log(x, 2).

# log2() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# log2() هنا قمنا بعرض قيمة اللوغارتم الثنائي للعدد 5 و التي أرجعتها الدالة 
print('log2(5) =', math.log2(5))

#-------------------------------------------------------------

# 8- الدالة log10(x) :
# جع قيمة اللوغارتم العشري ( Decimal Logarithm ) للعدد الذي نمرره لها مكان الباراميتر x.
# هذه الدالة تعتبر بديل للدالة log(x, 10).

# log10() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# log10() هنا قمنا بعرض قيمة اللوغارتم العشري للعدد 5 و التي أرجعتها الدالة 
print('log10(5) =', math.log10(5))

#-------------------------------------------------------------

# 9- الدالة sin(x) :
# ترجع قيمة جيب الزاوية للعدد الذي نمرره لها مكان الباراميتر x كعدد عشري نوعه float.

# sin() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# sin() هنا قمنا بعرض ناتج جيب الزاوية للعدد 25 الذي أرجعته الدالة
print('sin(25) =', math.sin(25))

#-------------------------------------------------------------

# 10- الدالة cos(x) :
# ترجع قيمة الجيب العكسي للعدد الذي نمرره لها مكان الباراميتر x كعدد عشري نوعه float.

# cos() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# cos() هنا قمنا بعرض ناتج الجيب العكسي للعدد 25 الذي أرجعته الدالة
print('cos(25) =', math.cos(25))

#-------------------------------------------------------------

# 11- الدالة tan(x) :
# ترجع قيمة ظل الزاوية للعدد الذي نمرره لها مكان الباراميتر x كعدد نوعه float.

# tan() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# tan() هنا قمنا بعرض ناتج ظل الزاوية للعدد 25 الذي أرجعته الدالة
print('tan(25) =', math.tan(25))

#-------------------------------------------------------------

# 12- الدالة asin(x) :
# ترجع قيمة الجيب العكسي للعدد الذي نمرره لها مكان الباراميتر x كعدد نوعه float.

# asin() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# asin() هنا قمنا بعرض ناتج الجيب العكسي للعدد 0.5 الذي أرجعته الدالة 
print('asin(0.5) =', math.asin(0.5))

#-------------------------------------------------------------

# 13- الدالة acos(x) :
# ترجع قيمة جيب التمام العكسي للعدد الذي نمرره لها مكان الباراميتر x كعدد نوعه float.

# acos() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# acos() هنا قمنا بعرض ناتج جيب التمام العكسي للعدد 0.5 الذي أرجعته الدالة
print('acos(0.5) =', math.acos(0.5))

#-------------------------------------------------------------

# 14- الدالة atan(x) :
# ترجع قيمة الظل العكسي للعدد الذي نمرره لها مكان الباراميتر x كعدد نوعه float.

# atan() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# atan() هنا قمنا بعرض ناتج الظل العكسي للعدد 40.5 الذي أرجعته الدالة 
print('atan(40.5) =', math.atan(40.5))

#-------------------------------------------------------------

# 15- الدالة degrees(x) :
# ترجع قيمة الزاوية للعدد الذي نمرره لها مكان الباراميتر x كعدد نوعه float.

# degrees() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# degrees() هنا قمنا بعرض قيمة الزاوية للعدد 15 الذي أرجعته الدالة 
print('degrees(15) =', math.degrees(15))

#-------------------------------------------------------------

# 16- الدالة radians(x) :
# ترجع قيمة الراديان التي نمررها لها كعدد بالزاوية مكان الباراميتر x.

# radians() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# radians() هنا قمنا بعرض قيمة الراديان للعدد 15 الذي أرجعته الدالة
print('radians(15) =', math.radians(15))

#-------------------------------------------------------------

# 17- الدالة gcd(x, y) :
# ترجع عدد صحيح يمثل القاسم المشترك الأكبر بين العددين اللذين نمررهما لها مكان الباراميترين x و y.

# gcd() الذي يحتوي على الدالة math هنا قمنا باستدعاء الموديول
import math

# gcd() هنا قمنا بعرض العدد المشترك الأكبر بين العددين 36 و 45 الذي أرجعته الدالة
print('gcd(36, 45) =', math.gcd(36, 45))

#-------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------------------------------

# ثوابت الموديول math :

# الموديول math يحتوي على الثوابت الاتية :

# e و pi الذي يحتوي على الثوابت math هنا قمنا باستدعاء الموديول
import math

# pi هنا قمنا بعرض قيمة الثابت
print('pi =', math.pi)    

# e هنا قمنا بعرض قيمة الثابت
print('e  =', math.e)

#-------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------------------------------

# دوال الموديوم random :
# random : هو موديل جاهز في بايثون يحتوي على دوال تستخدم في العمليات الحسابية و الهندسية، ذكرنا أهمها في الجدول التالي.

# 1- الدالة random :
# ترجع عدد عشري قيمته بين 0.0 و 1.0.

# المثال الأول :

# random() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول
import random

# random() هنا قمنا بعرض العدد الذي أرجعته الدالة
print('Random Number = ', random.random())

# random() هنا قمنا بعرض العدد الذي أرجعته الدالة
print('Random Number = ', random.random())

# random() هنا قمنا بعرض العدد الذي أرجعته الدالة
print('Random Number = ', random.random())

'''
يمكن تغيير نطاق الأعداد التي قد ترجعها الدالة random() باستخدام العمليات الحسابية.
فمثلاً يمكن ضرب العدد الذي ترجعه الدالة بالعدد 10 و تحويل الناتج إلى int فيصبح النطاق بين 0 <= N < 10

'''

# المثال الثاني :

# random() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول
import random

# و بعدها قمنا بعرضه int بـ 10 ثم حولنا الناتج إلى random() هنا قمنا بضرب العدد الذي أرجعته الدالة
print('Random Number = ', int(random.random()*10))

# و بعدها قمنا بعرضه int بـ 10 ثم حولنا الناتج إلى random() هنا قمنا بضرب العدد الذي أرجعته الدالة
print('Random Number = ', int(random.random()*10))

# و بعدها قمنا بعرضه int بـ 10 ثم حولنا الناتج إلى random() هنا قمنا بضرب العدد الذي أرجعته الدالة
print('Random Number = ', int(random.random()*10))

#-------------------------------------------------------------

# 2- الدالة uniform( a, b ) :
# ترجع عدد عشري عشوائي بين القيمة التي نمررها لها مكان الباراميتر a و القيمة التي نمررها لها مكان الباراميتر b.
# إذاً، نطاق الأعداد التي ترجعها هو a <= N <= b

# uniform() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول
import random

# هنا قمنا بطباعة ثلاث أعداد عشوائية بين 1 و 10
print('Random Number between [1-10] =', random.uniform(1, 10))
print('Random Number between [1-10] =', random.uniform(1, 10))
print('Random Number between [1-10] =', random.uniform(1, 10))

#-------------------------------------------------------------

# 3- الدالة الدالة randrange() :
# بناؤها : # الشكل الأول
# random.randrange(stop)

# الشكل الثاني
# random.randrange(start, stop[, step])

# ترجع عدد صحيح عشوائي بين 0 و القيمة التي نمررها لها مكان الباراميتر stop.
# أو ترجع عدد صحيح عشوائي بين القيمة التي نمررها لها مكان الباراميتر start و القيمة التي نمررها لها مكان الباراميتر stop.

# step :  باراميتر إختياري مكانه يمكن تمرير عدد صحيح يحدد بكم ستضرب القيمة العشوائية التي ترجعها الدالة مع الأخذ بعين الإعتبار أن الناتج يجب أن يكون ضمن النطاق الذي تم تحديده.

# randrange() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول
import random

# هنا قمنا عدد بطباعة عشوائي بين 0 و 10
print('Random Number between [0-10] = ', random.randrange(10))

# هنا قمنا عدد بطباعة عشوائي بين 1 و 50
print('Random Number between [1-50] = ', random.randrange(1, 50))

# هنا قمنا عدد بطباعة عشوائي بين 1 و 50 مع مع ضرب القيمة التي سترجع بـ 5
print('Random Number between [1-50, step=5] = ', random.randrange(1, 50, 5))

#-------------------------------------------------------------

# 4- الدالة choice(seq) :
# إذا مررنا لها مصفوفة من الأعداد، ترجع عدد عشوائي من ضمن هذه المصفوفة.
# إذا مررنا لها نص، ترجع حرف عشوائي من ضمن هذا النص.

# seq : عبارة عن شيء يمثل سلسلة من العناصر مثل مصفوفة أو نص.

# choice() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول
import random

# يحتوي على نص s هنا قمنا بتعريف متغير إسمه
s = 'harmash'

# lst هنا قمنا بتعريف مصفوفة تحتوي على أعداد إسمها
lst = [1, 2, 3, 4, 9]

# lst هنا قمنا بطباعة قيمة عنصر عشوائي من عناصر المصفوفة
print('Random element from the:', random.choice(lst))

# s هنا قمنا بطباعة حرف عشوائي من أحرف المتغير
print('Random character from the string:', random.choice(s))

#-------------------------------------------------------------

# 5- الدالة shuffle(x) :
# نمرر لها مصفوفة مكان الباراميتر x فتبدل أماكن عناصرها بشكل عشوائي.

import random            # shuffle() الذي يحتوي على الدالة random هنا قمنا باستدعاء الموديول

arr = [1, 2, 3, 4, 5]    # arr هنا قمنا بتعريف مصفوفة تحتوي على أعداد إسمها

print('arr =', arr)      # arr هنا قمنا بطباعة قيم جميع عناصر المصفوفة

random.shuffle(arr)      # shuffle() بشكل عشوائي بواسطة الدالة arr هنا قمنا بتبديل عناصر المصفوفة

print('arr =', arr)      # من جديد لنلاحظ الفرق arr هنا قمنا بطباعة قيم جميع عناصر المصفوفة

#-------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------------------------------
