#--------------------------------------------------------------------------------------------------------------

# الحلقات :

#--------------------------------------------------

# 1- الحلقة for :

# تحتوي على 7 عناصر days هنا قمنا بتعريف مصفوفة إسمها
days = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']

# هنا في كل دورة من دورات الحلقة سيتم تخزين قيمة عنصر جديد من 
# و من ثم سيتم عرض قيمته day في المتغير days عناصر المصفوفة
for day in days:
    print(day)

#--------------------------------------------------

# 2-  إستخدام الدالة range() مع الحلقة for :

# for هنا قمنا بإنشاء سلسلة من الأعداد الموجودة من 1 إلى 5 و مررنا عليها بواسطة الحلقة
# و من ثم طباعته n  في كل دورة في الحلقة سيتم جلب عدد من هذه السلسلة و تخزينه في المتغير
for n in range(1, 6, 1):
    print(n)


#--------------------------------------------------

# 3- الحلقة while :

i = 1

# و إذا i في كل دورة من دورات الحلقة سيتم فحص قيمة العداد
# كانت أصغر أو تساوي 5 سيتم طباعتها و من ثم إضافة 1 عليها
while i <= 5:
    print(i)
    i += 1

#--------------------------------------------------

# 4-  إستخدام الجملة الشرطية else مع الحلقة while في بايثون :

i = 1

# و إذا كانت i في كل دورة من دورات الحلقة سيتم فحص قيمة العداد
# أصغر أو تساوي 5 سيتم طباعتها و من ثم إضافة 1 عليها، و إن لم تكن
# else كذلك سيتم تنفيذ أمر الطباعة الموضوع في الجملة الشرطية
while i <= 5:
    print(i)
    i += 1
else:
    print('This block is executed when the condition return False!')

#--------------------------------------------------

#--------------------------------------------------------------------------------------------------------------
