# ==================================================================================================================================================

# النصوص :

# ----------------------------------------------------------------

# 1- طريقة تعريف نص :


#  إذا كان النص يتألف من سطر واحد يمكن استخدام الرمز ' ' أو الرمز " ".
#  إذا كان النص يتألف من عدة أسطر يمكن استخدام الرمز ''' ''' أو الرمز """ """.

# هنا قمنا بتعريف ثلاث متغيرات تحتوي على قيم نصية
name = 'Mhamad'
job = "Programmer"
message = '''This string that will span across multiple lines. No need to use newline characters for the next lines.
The end of lines within this string is counted as a newline when printed.'''

# هنا قمنا بعرض قيم المتغيرات النصية بأسلوب مرتب
print('Name: ', name)
print('Job: ', job)
print('Message: ', message)

# ----------------------------------------------------------------

# 2- طرق دمج النصوص :

# يمكنك تطبيق الدمج في بايثون بثلاث طرق:

#    الدمج التلقائي، إذا كان المراد دمج قيمتين نصيتين.
#   إستخدام العامل + مما يتيح دمج نص مع نص أو نص مع عدد.
#    إستخدام الدالة join() و التي تتيح دمج سلسلة من النصوص مع بعضها.


first_name = 'Mhamad'

last_name = 'Harmush'

full_name = first_name + ' ' + last_name 

print(full_name)

# ----------------------------------------------------------------

# 3- الوصول لأحرف النص :

# المثال الأول :

# يحتوي على نص s هنا قمنا بتعريف متغير إسمه
s = 'welcome to harmash.com'

# و بدأنا من اليسار s هنا قمنا بطباعة أول 7 أحرف موجودة في المتغير
print(s[0] + s[1] + s[2] + s[3] + s[4] + s[5] + s[6])

# المثال الثاني :

# يحتوي على نص s هنا قمنا بتعريف متغير إسمه
s = 'welcome to harmash.com'

# و بدأنا من اليمين s هنا قمنا بطباعة آخر 3 أحرف موجودة في المتغير
print(s[-3] + s[-2] + s[-1])

# ----------------------------------------------------------------

# 4- معرفة عدد أحرف النص :

# لمعرفة عدد أحرف النص نقوم باستدعاء الدالة len() و نمرر لها النص فقط.

s = 'welcome to harmash.com'     # s هنا قمنا بتعريف متغير نصي إسمه

print('Length of s =', len(s))   # len() الذي سترجعه الدالة s هنا قمنا بطباعة عدد أحرف (خانات) المتغير

# المسافات الفارغة ( White Spaces ) يتم حسابها كأحرف عادية.

# ----------------------------------------------------------------

# 5- تجزيء النص في بايثون بواسطة العامل [] :

# المثال الأول :

# يحتوي على نص s هنا قمنا بتعريف متغير إسمه
s = 'welcome to harmash.com'

# s هنا قمنا بطباعة جميع الأحرف الموجودة إبتداءاً من الخانة رقم 11 وصولاً إلى الخانة الموجودة ما قبل الخانة 18 في المتغير
print(s[11:18])

# المثال الثاني :

# يحتوي على نص s هنا قمنا بتعريف متغير إسمه
s = 'welcome to harmash.com'

# s هنا قمنا بطباعة جميع الأحرف الموجودة إبتداءاً من الخانة رقم 11 وصولاً إلى آخر خانة موجودة في المتغير
print(s[11:])

# ----------------------------------------------------------------

# 6- الرموز التي من خلالها نعرف نهاية السطر :

'''

\n          Line Feed
\r 	        Carriage Return
\r\n        Carriage Return + Line Feed
\v or \x0b 	Line Tabulation
\f or \x0c 	Form Feed
\x1c 	    File Separator
\x1d 	    Group Separator
\x1e 	    Record Separator
\x85 	    Next Line (C1 Control Code)
\u2028 	    Line Separator
\u2029 	    Paragraph Separator

''' 

# ----------------------------------------------------------------

# ==================================================================================================================================================

# الدوال الجاهزة في الكلاس str :

# هو كلاس جاهز في بايثون يحتوي على دوال كثيرة للتعامل مع محتوى النصوص سواء للبحث عن أحرف أو كلمات أو جمل، تجزيء النص، تغيير حالة الأحرف، دمج النصوص و غيرها.

'''

  سنقسم دوال الكلاس str إلى 5 فئات أساسية:

    دوال للبحث ( Searching ).
    دوال للتجزيء ( Substring ).
    دوال للتبديل ( Replacing ).
    دوال للمقارنة ( Comparison ).
    دوال للمعالجة ( Manipulation ).

'''

# [1] دوال البحث الموجودة في الكلاس str :

# 1- الدالة count() :
# تبحث في النص الذي قام باستدعائها عن النص الذي نمرره لها مكان الباراميتر sub ثم ترجع عدد المرات التي تم فيها العثور عليه.

# بناؤها : count (sub[, start[, end]]) .

# sub : عبارة عن نص عادي نوعه str و هو النص الذي نريد البحث عنه.
# start :  باراميتر إختياري، مكانه يمكن تمرير رقم الخانة التي سيتم بدء البحث من عندها.
# end :    باراميتر إختياري، مكانه يمكن تمرير رقم الخانة التي سيتم إيقاف البحث قبلها.

# # s هنا قمنا بتعريف متغير نصي إسمه
s = "Hello, my name is Mhamad. I'm a full stack developer."

# s في النص الموجود في المتغير 'a' هنا قمنا بطباعة كم مرة يوجد النص
print(s.count('a'))

# ----------------------------------------------------------------

# 2-  الدالة find() :
# تبحث في النص الذي قام باستدعائها عن رقم أول خانة يوجد عندها النص الذي نمرره لها مكان الباراميتر sub و ترجعه.

# بناؤها : find (sub[, start[, end]]) .

# sub : عبارة عن نص عادي نوعه str و هو النص الذي نريد البحث عنه.
# start : باراميتر إختياري، مكانه يمكن تمرير رقم الخانة التي سيتم بدء البحث من عندها.
# end :  باراميتر إختياري، مكانه يمكن تمرير رقم الخانة التي سيتم إيقاف البحث قبلها.

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is a programming language. Python is easy to learn.'

# و بالتالي سيتم طباعة 0 'P' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.find('P'))

# و بالتالي سيتم طباعة 0 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.find('Python'))

# مع الإشارة إلى أننا بدأنا عملية البحث من الخانة رقم 10 و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.find('Python', 10))

# -1 و بما أنه لا يوجد هذه الكلمة سيتم طباعة 'Java' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.find('Java'))

# ----------------------------------------------------------------

# 3- الدالة rfind() :
# تبحث في النص الذي قام باستدعائها عن رقم أول خانة يوجد عندها النص الذي نمرره لها مكان الباراميتر sub و ترجعه.
# عملية البحث التي تجريها هذه الدالة تبدأ بشكل عكسي ( Reversed ) من آخر النص الذي قام باستدعائها إلى أوله.

# # s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is a programming language. Python is easy to learn.'

# و بالتالي سيتم طباعة 34 'P' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rfind('P'))

# و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rfind('Python'))

# و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
# هنا عملية البحث بدأت من آخر خانة وصولاً إلى الخانة رقم 10.
print(s.rfind('Python', 10))

# -1 و بما أنه لا يوجد هذه الكلمة سيتم طباعة 'Java' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.rfind('Java'))

# ----------------------------------------------------------------

# 4- الدالة index() :
# تبحث في النص الذي قام باستدعائها عن رقم أول خانة يوجد عندها النص الذي نمرره لها مكان الباراميتر sub و ترجعه.

# الفرق بينها و بين الدالة find() أنه في حال لم يتم العثور على النص المراد البحث عنه فإنها ترمي الإستثناء ValueError.

# بناؤها : index(sub[, start[, end]]) .

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is a programming language. Python is easy to learn.'

# و بالتالي سيتم طباعة 0 'P' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.index('P'))

# و بالتالي سيتم طباعة 0 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.index('Python'))

# مع الإشارة إلى أننا بدأنا عملية البحث من الخانة رقم 10 و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.index('Python', 10))

# ValueError و بما أنه لا يوجد هذه الكلمة سيتم إظهار خطأ بعنوان 'Java' يوجد عندها النص s هنا قمنا بطباعة رقم أول خانة في المتغير
print(s.index('is')) # is بدل Java

# ----------------------------------------------------------------

# 5- الدالة rindex() :
# تبحث في النص الذي قام باستدعائها عن رقم أول خانة يوجد عندها النص الذي نمرره لها مكان الباراميتر sub و ترجعه.

# الفرق بينها و بين الدالة index() أنها تبدأ عملية البحث من آخر خانة في النص الذي قام باستدعائها رجوعاً إلى أول خانة فيه.

# بناؤها : rindex(sub[, start[, end]]) .

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is a programming language. Python is easy to learn.'

# و بالتالي سيتم طباعة 34 'P' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rindex('P'))

# و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rindex('Python'))

# مع الإشارة إلى أننا بدأنا عملية البحث من آخر خانة وصولاً إلى الخانة رقم 10 و بالتالي سيتم طباعة 34 'Python' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rindex('Python', 10))

# ValueError و بما أنه لا يوجد هذه الكلمة سيتم إظهار خطأ بعنوان 'Java' يوجد عندها النص s هنا قمنا بطباعة رقم آخر خانة في المتغير
print(s.rindex('is')) # is بدل Java

# ----------------------------------------------------------------

# [2] دوال التجزيء الموجودة في الكلاس str :

# 1- الدالة split() :
# تقسم النص إلى أجزاء وتحوله إلى قائمة (list) .

# بناؤها : .split(sep=None, maxsplit=-1) .

# sap : أي الخانة التي سيبدأ التقسيم من عندها , وأيضا هذا الخانة لن تطبع في الناتج .

# maxsplit : أقصى عدد لعمليات التقسيم.

# المثال الأول :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'split method is very useful.'      

# على أساس المسافة الفارغة s لتجزئة النص الموجود في المتغير  split() هنا قمنا باستدعاء الدالة
# arr و هكذا سيتم وضع كل كلمة في النص في عنصر في المصفوفة
arr = s.split(" ")              

# هنا سيتم طباعة شكل النص الجديد 
print(arr)

# لاحظ أن كل عنصر يحتوي على كلمة واحدة .arr هنا قمنا بطباعة النص الذي تم تقسيمه على 5 عناصر في المصفوفة
print(arr[0])
print(arr[1])
print(arr[2])
print(arr[3])
print(arr[4]) 

# المثال الثاني :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'split method is very useful.'      

# على أساس المسافة الفارغة s لتجزئة النص الموجود في المتغير  split() هنا قمنا باستدعاء الدالة
# arr و هكذا سيتم وضع كل كلمة في النص في عنصر في المصفوفة
arr = s.split(' ')              

# for باستخدام الحلقة arr هنا قمنا بعرض قيم المصفوفة
for element in arr:
    print(element)

# ----------------------------------------------------------------

# 2- الدالة splitlines() :
# ترجع نسخة من النص الذي قام باستدعائها مقسمة على شكل مصفوفة نصوص.

# بناؤها : str.splitlines([keepends]) .

# keepends : هو باراميتر إختياري، مكانه يمكن تمرير القيمة True لإبقاء الرموز التي من خلالها عرف مترجم بايثون كيف يفصل الأسطر عن بعضها أو False لعدم إبقائها .

# يتألف من ثلاث أسطر s هنا قمنا بتعريف متغير نصي إسمه
s = 'This is fist line.\nThis is second line.\nThis is third line.'

# هنا قمنا بطباعة النص في صورته الجديدة (list)
print (s.splitlines())

# ----------------------------------------------------------------

# [3] دوال التبديل الموجودة في الكلاس str :


# 1- الدالة replace() :
#ترجع نسخة من النص الذي قام باستدعائها مع تبديل كل جزئية فيها تتطابق مع النص نمرره لها مكان الباراميتر old بالنص الذي نمرره لها مكان الباراميتر new.

# بناؤها : replace(old, new [, count]) .

# old : مكان هذا الباراميتر  نمرر نص الذي نريد استبداله في النص الأصلي.
# new : مكان هذا الباراميتر  نمرر نص الذي سيحل مكانه في النسخة التي سترجعها.
# count : هو باراميتر إختياري، مكانه يمكن تمرير رقم أكبر من صفر يمثل أول كم جزئية يتم العثور عليها سيتم تبديلها.

# المثال الأول :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'java is easy to learn. anyone can learn java.'

# كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s)

# 'python' بالكلمة s وجدتها في المتغير 'java' بعد أن بدلت كل كلمة replace() هنا قمنا بطباعة ما سترجعه الدالة
print(s.replace('java', 'python'))


# المثال الثاني :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'java is easy to learn. anyone can learn java.'

# كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s)

# 'python' بالكلمة s وجدتها في المتغير 'java' بعد أن بدلت أول كلمة replace() هنا قمنا بطباعة ما سترجعه الدالة
print(s.replace('java', 'python', 1))

# ----------------------------------------------------------------

# 2- الدالة maketrans() :
# تستخدم لبناء قاموس يمكن إستخدامه لتبديل أحرف النص بأحرف أخرى.

# من بعدها يجب استخدام الدالة translate() لتطبيق القاموس الذي تم تجهيزه على النص.

# بناؤها : static str.maketrans(x[, y[, z]]).

# x : مكان هذا الباراميتر نمرر الحرف أو المجموعة المراد تبديلها ، كما أنه يمكن تمرير قاموس بشكل مباشر مكانه وفيه يتم 
#     تحديد ما سيتم تبديله واستبداله .

# y :  هو باراميتر إختياري، مكانه يمكن تمرير الحرف أو مجموعة الأحرف المراد وضعها بدل الأحرف التي تم تمريرها مكان الباراميتر x.

# z : هو باراميتر إختياري، مكانه يمكن تمرير حرف أو مجموعة أحرف ليتم حذفها.


# المثال الأول : 

s = 'harmash.com'                       # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('a', '-')    # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف .dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه

print(s)                                # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))          # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الثاني :

s = 'harmash.com'                         # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('am', '-*')    # dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه
                                          # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف
                                          # '*' بالرمز 'm' و سيتم تبديل كل حرف

print(s)                                  # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))            # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الثالث :

s = 'harmash.com'                           # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('a', '-', 'm')   # dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه
                                            # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف
                                            # يتم إيجاده 'm' كما أنه سيتم حذف كل حرف
                                             
print(s)                                    # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))              # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الرابع :

s = 'harmash.com'                 # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans({      
    'h': '',                   # هنا سيتم حذف اي h
    'a': ' ',                  # هنا سيتم استبدال اي حرف a بمسافة 
    '.': '5'                   # هنا سيتم استبدال أي نقطة برقم 5
})

print(s)                          # كما هو s هنا قمنا بطباعة النص الموجود في المتغير

print(s.translate(dictionary))    # s على المتغير table بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# 3- الدالة translate() :
# ترجع نسخة من النص الذي قام باستدعائها مع تبديل بعض أحرف هذه النسخة بأحرف أخرى أو حذفها بالإعتماد على القاموس الذي نمرره لها مكان الباراميتر table.

# القاموس الذي يتم تمريره لهذه الدالة يتم بناؤه بالأساس بواسطة الدالة str.maketrans().

# بناؤها : str.translate(table) .

# مكان الباراميتر table نمرر كائن نوعه table يمثل القاموس الذي ستعتمده الدالة عند تعديل محتوى النص الذي سترجعه.

# المثال الأول :

s = 'harmash.com'                       # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('a', '-')    # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف .dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه

print(s)                                # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))          # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الثاني :

s = 'harmash.com'                         # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('am', '-*')    # dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه
                                          # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف
                                          # '*' بالرمز 'm' و سيتم تبديل كل حرف
                                          # يتم إيجاده 'o' كما أنه سيتم حذف كل حرف

print(s)                                  # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))            # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الثالث :

s = 'harmash.com'                           # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans('a', '-', 'm')   # dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه
                                            # '-' بالرمز 'a' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف
                                            # يتم إيجاده 'm' كما أنه سيتم حذف كل حرف
                                             
print(s)                                    # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.translate(dictionary))              # s على المتغير dictionary بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة


# المثال الرابع :

s = 'harmash.com'                 # s هنا قمنا بتعريف متغير نصي إسمه

dictionary = str.maketrans({      # dictionary هنا قمنا بإنشاء قاموس للترجمة إسمه
    'h': 'XYZ',                   # 'XYZ' بالأحرف 'h' عند الترجمة بواسطة هذا القاموس سيتم تبديل كل حرف
    'a': '555',                   # '555' بالأحرف 'a' و سيتم تبديل كل حرف
    '.': ''                       # كما أنه سيتم حذف كل نقطة يتم إيجادها
})

print(s)                          # كما هو s هنا قمنا بطباعة النص الموجود في المتغير

print(s.translate(dictionary))    # s على المتغير table بعد تطبيق الترجمة المخزنة في القاموس translate() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# [4] دوال المعالجة الموجودة في الكلاس str :


# 1- الدالة upper(s) :
# ترجع نسخة من النص الذي نمرره لها عند استدعائها مكان الباراميتر s كل أحرفه كبيرة.

s = 'Welcome To Harmash.com'  # s هنا قمنا بتعريف متغير نصي إسمه

print(str.upper(s))           # upper() هنا قمنا بطباعة النص الذي سترجعه الدالة

# ----------------------------------------------------------------

# 2- الدالة lower(s) :
# ترجع نسخة من النص الذي نمرره لها عند استدعائها مكان الباراميتر s كل أحرفه صغيرة.

s = 'Welcome To Harmash.com'  # s هنا قمنا بتعريف متغير نصي إسمه

print(str.lower(s))           # lower() هنا قمنا بطباعة النص الذي سترجعه الدالة

# ----------------------------------------------------------------

# 3- الدالة swapcase() :
# ترجع نسخة من النص الذي قام باستدعائها مع تحويل الأحرف الكبيرة فيها لأحرف صغيرة و الأحرف الصغيرة فيها لأحرف كبيرة.

# وضعنا فيه جملة أحرفها كبيرة و جملة أحرفها صغيرة s هنا قمنا بتعريف متغير نصي إسمه
s = 'WE ARE CAPITAL LETTERS. we are small letters'

# swapcase() هنا قمنا بطباعة النص الذي سترجعه الدالة
# لاحظ أن الأحرف الكبيرة قلبت لأحرف صغيرة و الأحرف الصغيرة قلبت لأحرف كبيرة 
print(str.swapcase(s))

# ----------------------------------------------------------------

# 4- الدالة capitalize(s) :
# ترجع نسخة من النص الذي نمرره لها عند استدعائها مكان الباراميتر s مع تحويل أول حرف فيه لحرف كبير.

s = 'how old are you?'      # s هنا قمنا بتعريف متغير نصي إسمه

print(str.capitalize(s))    # capitalize() هنا قمنا بطباعة النص الذي سترجعه الدالة

# ----------------------------------------------------------------

# 5- الدالة title(s) :
# ترجع نسخة من النص الذي نمرره لها عند استدعائها مكان الباراميتر s مع تحويل أول حرف من كل كلمة فيه لحرف كبير.

s = 'best python tutorial'   # s هنا قمنا بتعريف متغير نصي إسمه

print(str.title(s))          # title() هنا قمنا بطباعة النص الذي سترجعه الدالة

# ----------------------------------------------------------------

# 6- الدالة join(iterable) :
# ترجع نص جديد يمثل النص الذي قام باستدعائها مدمجاً بالنص أو بمصفوفة النصوص التي نمرره لها مكان الباراميتر iterable.

# المثال الأول :

s1 = '-'              # s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'HARMASH'        # s2 هنا قمنا بتعريف متغير نصي إسمه

print(s1.join(s2))    # join() هنا قمنا بعرض النص الذي سترجعه الدالة


# المثال الثاني :

s = '-'                         # s هنا قمنا بتعريف متغير نصي إسمه
arr = ['Jad', 'Nora', 'Hanna']  # و تحتوي على ثلاث نصوص arr إسمها ,هنا قمنا بتعريف مصفوفة من النوع

print(s.join(arr))              # join() هنا قمنا بعرض النص الذي سترجعه الدالة

# ----------------------------------------------------------------

# 7- الدالة center() :
# ترجع نسخة من النص و تضيف مسافات فارغة حوله عند الحاجة لجعله يظهر كأنه في المنتصف.

# بناؤها : str.center(width[, fillchar]) .

# width : نمرر مكانه عدد يحدد طول السطر ، لأنه في حال كان طول النص أصغر من طول السطر سيتم صنع مسافة فارغة حول النص لجعله في منتصف السطر .
# fillchar :     هو باراميتر إختياري، مكانه يمكن تمرير حرف ليتم وضعه بدلاً من وضع مسافات فارغة.

# المثال الأول :

# يتألف من 30 حرف s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is my favorite language'

# و التي من المفترض أن تضيف مسافات center() هنا قمنا بطباعة النص الذي سترجعه الدالة
# فارغة حول النص حتى يظهر في المنتصف نسبة لأن طول النص يتكون من 40 حرف 
print(s.center(40))

# المثال الثاني :

# يتألف من 30 حرف s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is my favorite language'

# و التي من المفترض أن تضيف center() هنا قمنا بطباعة النص الذي سترجعه الدالة
# نقط حول النص حتى يظهر في المنتصف نسبة لأن طول النص يتكون من 40 حرف 
print(s.center(40, '.'))

# المثال الثالث :

# يتألف من 30 حرف s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is my favorite language'

# و التي من المفترض أن تضيف center() هنا قمنا بطباعة النص الذي سترجعه الدالة
# نقط حول النص حتى يظهر في المنتصف إذا كان طول النص يتكون من أقل من 20 حرف 
print(s.center(20, '.'))

# ----------------------------------------------------------------

# 8- الدالة expandtaps() :
# ترجع نسخة من النص الذي قام باستدعائها مع مضاعفة حجم المسافات الفارغة ( Tab Spaces ) التي تم إضافتها في النص بواسطة الرمز \t.

# بناؤها : str.expandtabs(tabsize=8) .

# tabsize : مكان هذا الباراميتر يمكن تمرير عدد صحيح يمثل عدد المسافات الفارغة التي سيتم وضعها مكان كل رمز \t موضوع في النص.
# في حال لم يتم تمرير قيمة لهذا الباراميتر فإنه سيحول كل رمز \t إلى 8 مسافات فارغة.

# في بداية النص، أي يحتوي على 4 مسافات فارغة \t يحتوي على الرمز s هنا قمنا بتعريف متغير نصي إسمه
s = '\tWe add a tab space at the beginning.'

# s هنا قمنا بعرض النص الموجود في المتغير
print(s)

# بـ 8 مسافات فارغة \t بعد أن تم تبديل الرمز s هنا قمنا بعرض النص الموجود في المتغير
print(s.expandtabs())

# بـ 12 مسافات فارغة \t بعد أن تم تبديل الرمز s هنا قمنا بعرض النص الموجود في المتغير
print(s.expandtabs(12))

# ----------------------------------------------------------------

# 9- الدالة lstrip() :
# ترجع نسخة من النص الذي قام باستدعائها مع إزالة أي مسافة فارغة موجودة في بدايته.

s = '     Python tutorial'   # وضعنا في بدايته بعض المسافات الفارغة s هنا قمنا بتعريف متغير نصي إسمه

print(s)                     # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.lstrip())            # s عند استدعاءها على المتغير lstrip() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# 10- الدالة rstrip() :
# ترجع نسخة من النص الذي قام باستدعائها مع إزالة أي مسافة فارغة موجودة في نهايته.

s = 'Python tutorial     '   # وضعنا في نهايته بعض المسافات الفارغة s هنا قمنا بتعريف متغير نصي إسمه

print(s)                     # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.rstrip())            # s عند استدعاءها على المتغير rstrip() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# 11- الدالة strip() :
# ترجع نسخة من النص الذي قام باستدعائها مع حذف أي مسافة فارغة موجودة في بدايته و نهايته.

# بناؤها : str.strip([chars]) .

# chars : هو باراميتر إختياري، مكانه يمكننا تمرير نص ليتم حذفه من النسخة التي سترجعها الدالة في حال كان موجوداً في بداية أو نهاية النص الذي قام باستدعائها.

# المثال الأول : 

s = '    Python tutorial    '   # وضعنا في بدايته و نهايته بعض المسافات الفارغة s هنا قمنا بتعريف متغير نصي إسمه

print(s)                        # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.strip(''))              # s عند استدعاءها على المتغير strip() هنا قمنا بطباعة ما سترجعه الدالة

# المثال الثاني : 

s = '---- Python tutorial ----'   # '-' وضعنا في بدايته و نهايته بعض الرموز s هنا قمنا بتعريف متغير نصي إسمه

print(s)                          # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.strip('-'))               # s عند استدعاءها على المتغير strip() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# 12- الدالة ljust() :
# ترجع نسخة من النص الذي قام باستدعائها مع إضافة مسافات فارغة في نهايته إذا تجاوز عدد أحرفه العدد الذي نمرره مكان الباراميتر width.
#  و يمكننا تمرير أي حرف أو رمز مكان الباراميتر fillchar ليظهر بدلاً من المسافات الفارغة.

# بناؤها : str.ljust(width[, fillchar]) .

# width : مكانه نمرر رقم يحدد طول السطر، عندها في حال كان طول النص أصغر من طول السطر سيتم إضافة مسافات فارغة بعده.
# fillchar :  هو باراميتر إختياري، مكانه يمكننا تمرير أي حرف ليتم وضعه بدل وضع مسافات فارغة.

s = 'Python tutorial'       # s هنا قمنا بتعريف متغير نصي إسمه

print(s)                    # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.ljust(30))          # حتى يصبح عدد الأحرف يساوي 30 s بعد إضافة بعض المسافات الفارغة في آخر نص المتغير lstrip() هنا قمنا بطباعة ما سترجعه الدالة
print(s.ljust(30, '-'))     # حتى يصبح عدد الأحرف يساوي 30 s بعد إضافة الرمز '-' عدة مرات في آخر نص المتغير lstrip() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# 13- الدالة rjust() :
# ترجع نسخة من النص الذي قام باستدعائها مع إضافة مسافات فارغة في بدايته إذا لم تجاوز عدد أحرفه العدد الذي نمرره مكان الباراميتر width.
#  و يمكننا تمرير أي حرف أو رمز مكان الباراميتر fillchar ليظهر بدلاً من المسافات الفارغة.

s = 'Python tutorial'       # s هنا قمنا بتعريف متغير نصي إسمه

print(s)                    # كما هو s هنا قمنا بطباعة النص الموجود في المتغير
print(s.rjust(30))          # حتى يصبح عدد الأحرف يساوي 30 s بعد إضافة بعض المسافات الفارغة في أول نص المتغير lstrip() هنا قمنا بطباعة ما سترجعه الدالة
print(s.rjust(30, '-'))     # حتى يصبح عدد الأحرف يساوي 30 s بعد إضافة الرمز '-' عدة مرات في أول نص المتغير lstrip() هنا قمنا بطباعة ما سترجعه الدالة

# ----------------------------------------------------------------

# [5] دوال المقارنة الموجودة في الكلاس str في بايثون :


# 1- الدالة startswith() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يبدأ بنص معين أم لا.

# بناؤها : startswith(sub[, start[, end]]) .

# sub : مكانه نمرر نص أو مصفوفة نصوص نوعها tuple.
# start : باراميتر إختياري، مكانه يمكننا تمرير رقم الخانة التي نريد أن يبدأ البحث عندها.
# end : باراميتر إختياري، مكانه يمكننا تمرير رقم الخانة التي نريد أن يتوقف البحث قبلها.

# start و end يمكن تمرير قيم مكانهما فقط في حال تم تمرير نص عادي مكان الباراميتر sub.

# المثال الأول :

s = 'welcome to harmash.com';        # s هنا قمنا بتعريف متغير نصي إسمه

print(s.startswith('welcome to'))    # s موجود في بداية نص المتغير 'welcome to' لأن النص True سترجع startswith() هنا الدالة
print(s.startswith('welc'))          # s موجود في بداية نص المتغير 'welc' لأن النص True سترجع startswith() هنا الدالة
print(s.startswith('harmash'))       # s غير موجود في بداية نص المتغير 'harmash' لأن النص False سترجع startswith() هنا الدالة
print(s.startswith('harmash', 11))   # s موجود في بداية الخانة رقم 11 في المتغير 'harmash' لأن النص True سترجع startswith() هنا الدالة
print(s.startswith(''))              # لأننا نختبر قيمة نص فارغ True سترجع startswith() هنا الدالة

# المثال الثاني :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'Python is a programming language.'

# و تحتوي على 3 نصوص tuple هنا قمنا بتعريف مصفوفة قيم نصية نوعها
arr = ('Java', 'Python', 'PHP')

# True سيتم طباعة 'PHP' أو النص 'Python' أو النص 'Java' إذا كان يبدأ بالنص .s هنا قمنا باختبار قيمة المتغير
print(s.startswith(arr))

# ----------------------------------------------------------------

# 2- الدالة endswith() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها ينتهي بنص معين أم لا.

# المثال الأول :

s = 'welcome to harmash.com';          # s هنا قمنا بتعريف متغير نصي إسمه

print(s.endswith('harmash.com'))       # s موجود في نهاية نص المتغير 'harmash.com' لأن النص True سترجع endswith() هنا الدالة
print(s.endswith('harmash'))           # s غير موجود في نهاية نص المتغير 'harmash' لأن النص False سترجع endswith() هنا الدالة
print(s.endswith('harmash', 11))       # .com حيث يوجد بعده s ليس لوحده موجوداً إبتداءاً من الخانة رقم 11 في المتغير 'harmash' لأن النص False سترجع endswith() هنا الدالة
print(s.endswith('harmash', 11, 18))   # s موجود في بداية الخانة رقم 11 و قبل الخانة رقم 18 في المتغير 'harmash' لأن النص True سترجع endswith() هنا الدالة
print(s.endswith(''))                  # لأننا نختبر قيمة نص فارغ True سترجع endswith() هنا الدالة

# المثال الثاني :

# s هنا قمنا بتعريف متغير نصي إسمه
s = 'My favorite language is Python'

# و تحتوي على 3 نصوص tuple هنا قمنا بتعريف مصفوفة قيم نصية نوعها
arr = ('Java', 'Python', 'PHP')

# True سيتم طباعة 'PHP' أو النص 'Python' أو النص 'Java' إذا كان ينتهي بالنص .s هنا قمنا باختبار قيمة المتغير
print(s.endswith(arr))

# ----------------------------------------------------------------

# 3- الدالة isalpha() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي على أحرف أبجدية فقط أم لا.

s1 = 'a'                # وضعنا فيه حرف أبجدي s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'abc'              # وضعنا فيه مجموعة أحرف أبجدية s2 هنا قمنا بتعريف متغير نصي إسمه
s3 = 'a c'              # وضعنا فيه حرفين و بينهما مسافة فارغة s3 هنا قمنا بتعريف متغير نصي إسمه
s4 = '5'                # وضعنا فيه رقم s4 هنا قمنا بتعريف متغير نصي إسمه
s5 = 'A+'               # + وضعنا فيه حرف أبجدي و الرمز s5 هنا قمنا بتعريف متغير نصي إسمه
s6 = ''                 # لم نضع فيه أي شيء s6 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isalpha())     # True  و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isalpha())     # True  و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة
print(s3.isalpha())     # False و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة
print(s4.isalpha())     # False و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة
print(s5.isalpha())     # False و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة
print(s6.isalpha())     # False و التي سترجع isalpha() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 4- الدالة isnumeric() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي على أرقام فقط أم لا.

s1 = '5'                  # وضعنا فيه رقم s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = '500'                # وضعنا فيه مجموعة أرقام s2 هنا قمنا بتعريف متغير نصي إسمه
s3 = '½'                  # وضعنا فيه رمز يمثل 1 مقسوم على 2 s3 هنا قمنا بتعريف متغير نصي إسمه
s4 = '5 0'                # وضعنا فيه رقمين و بينهما مسافة فارغة s4 هنا قمنا بتعريف متغير نصي إسمه
s5 = '3D'                 # وضعنا فيه حرف و رقم s5 هنا قمنا بتعريف متغير نصي إسمه
s6 = ''                   # لم نضع فيه أي شيء s6 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isnumeric())     # True  و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isnumeric())     # True  و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة
print(s3.isnumeric())     # True  و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة
print(s4.isnumeric())     # False و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة
print(s5.isnumeric())     # False و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة
print(s6.isnumeric())     # False و التي سترجع isnumeric() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 5- الدالة isdigit() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي على رقم أو مجموعة أرقام فقط أم لا.

# هذه الدالة لا تعتبر الرموز التي تمثل قيم رقمية مثل الرمز ½ كرقم، و هذا هو الفرق بينها و بين الدالة isnumeric().

s1 = '5'                # وضعنا فيه رقم s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = '500'              # وضعنا فيه مجموعة أرقام s2 هنا قمنا بتعريف متغير نصي إسمه
s3 = '½'                # وضعنا فيه رمز يمثل 1 مقسوم على 2 s3 هنا قمنا بتعريف متغير نصي إسمه
s4 = '5 0'              # وضعنا فيه رقمين و بينهما مسافة فارغة s4 هنا قمنا بتعريف متغير نصي إسمه
s5 = '3D'               # وضعنا فيه حرف و رقم s5 هنا قمنا بتعريف متغير نصي إسمه
s6 = ''                 # لم نضع فيه أي شيء s6 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isdigit())     # True  و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isdigit())     # True  و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة
print(s3.isdigit())     # False و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة
print(s4.isdigit())     # False و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة
print(s5.isdigit())     # False و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة
print(s6.isdigit())     # False و التي سترجع isdigit() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 6- الدالة isalnum() :
# تستخدم لمعرفة ما إن كان النص الذي قام باستدعائها يحتوي على أحرف أبجدية و أرقام فقط أم لا.

s1 = 'Python'                # وضعنا فيه أحرف أبجدية s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = '123456'                # وضعنا فيه أرقام s2 هنا قمنا بتعريف متغير نصي إسمه
s3 = '3D'                    # وضعنا فيه حرف و رقم s3 هنا قمنا بتعريف متغير نصي إسمه
s4 = "90s"                   # وضعنا فيه أحرف أبجدية و رقم s4 هنا قمنا بتعريف متغير نصي إسمه
s5 = 'A'                     # وضعنا فيه حرف أبجدي s5 هنا قمنا بتعريف متغير نصي إسمه
s6 = '6'                     # وضعنا فيه رقم s6 هنا قمنا بتعريف متغير نصي إسمه
s7 = ''                      # لم نضع فيه أي شيء s7 هنا قمنا بتعريف متغير نصي إسمه
s8 = 'facebook.com'          # وضعنا فيه أحرف أبجدية و نقطة s8 هنا قمنا بتعريف متغير نصي إسمه
s9 = 'facebook and google'   # وضعنا فيه أحرف أبجدية و مسافات فارغة s9 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s3.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s4.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s5.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s6.isalnum())          # True  و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s7.isalnum())          # False و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s8.isalnum())          # False و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة
print(s9.isalnum())          # False و التي سترجع isalnum() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 7- الدالة islower() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي فقط على أحرف أبجدية صغيرة ( Small Letters ) أم لا.

s1 = 'python language'   # وضعنا فيه نص يتألف من أحرف صغيرة فقط s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'Python Language'   # وضعنا فيه نص يتألف من أحرف صغيرة فقط s1 هنا قمنا بتعريف متغير نصي إسمه

print(s1.islower())      # True  و التي سترجع islower() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.islower())      # False و التي سترجع islower() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 8- الدالة upper() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي فقط على أحرف أبجدية كبيرة (Capital Letters) فقط أم لا.

s1 = 'PYTHON LANGUAGE'   # وضعنا فيه نص يتألف من أحرف صغيرة فقط s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'Python Language'   # وضعنا فيه نص يتألف من أحرف صغيرة فقط s1 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isupper())      # True  و التي سترجع isupper() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isupper())      # False و التي سترجع isupper() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 9- الدالة title() :
# تستخدم لمعرفة ما إذا كان أول حرف من كل كلمة في النص الذي قام باستدعائها هو حرف كبير ( Capital Letter ) أم لا.

s1 = 'Learn Python For Beginners'   # وضعنا فيه نص يحتوي على مجموعة كلمات تبدأ كل واحدة منها بحرف كبير s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'Learn python for beginners'   # وضعنا فيه نص يحتوي على مجموعة كلمات، أول واحدة منهم فقط تبدأ بحرف كبير s2 هنا قمنا بتعريف متغير نصي إسمه

print(s1.istitle())                 # True  و التي سترجع istitle() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.istitle())                 # False و التي سترجع istitle() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# 10- الدالة isspace() :
# تستخدم لمعرفة ما إذا كان النص الذي قام باستدعائها يحتوي على مسافة فارغة ( White Space ) أو عدة مسافات فارغة فقط أم لا.

s1 = ' '               # وضعنا فيه نص يتألف من مسافة فارغة s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = '    '            # وضعنا فيه 4 مسافات فارغة s2 هنا قمنا بتعريف متغير نصي إسمه
s3 = 'Hi  '            # وضعنا فيه نص يتألف من أحرف أبجدية و مسافات فارغة s3 هنا قمنا بتعريف متغير نصي إسمه
s4 = ''                # لم نضع فيه أي شيء s4 هنا قمنا بتعريف متغير نصي إسمه

print(s1.isspace())    # True  و التي سترجع isspace() هنا قمنا بطباعة ما سترجعه الدالة
print(s2.isspace())    # True  و التي سترجع isspace() هنا قمنا بطباعة ما سترجعه الدالة
print(s3.isspace())    # False و التي سترجع isspace() هنا قمنا بطباعة ما سترجعه الدالة
print(s4.isspace())    # False و التي سترجع isspace() هنا قمنا بطباعة ما سترجعه الدالة

# ---------------------------------------------------------------

# ==================================================================================================================================================

# العوامل التي تستخدم للتعامل مع النصوص .


# 1- العامل +     :
# هذا العامل يستخدم لدمج نصّين أو أكثر و يرجعهم كنص جديد.

s1 = 'Mhamad'        # يتألف من كلمة واحدة s1 هنا قمنا بتعريف متغير نصي إسمه
s2 = 'Harmush'       # يتألف من كلمة واحدة s2 هنا قمنا بتعريف متغير نصي إسمه

s3 = s1 + ' ' + s2   # s2 يليه مسافة فارغة، يليه النص الموجود في ،s1 هنا قمنا بتعريف متغير نصي وضعنا فيه النص الموجود في

print(s3)            # s3 هنا قمنا بطباعة ما تم وضعه في المتغير

# ---------------------------------------------------------------

# 2- العامل *    :
# هذا العامل يستخدم لتكرار النص عدد محدد من المرات .

s1 = 'Python '    # يتألف من كلمة واحدة s1 هنا قمنا بتعريف متغير نصي إسمه

s2 = s1 * 5       # s2 خمسة مرات و وضعنا النتيجة النهائية في المتغير s1 هنا قمنا بتكرار النص  الموجود في المتغير

print(s2)         # s2 هنا قمنا بطباعة ما تم وضعه في المتغير

# ---------------------------------------------------------------

# 3- العامل %    :
# هذا العامل يستخدم لدمج النصوص و غالباً ما يستخدم أثناء عرض محتوى أي نص بطريقة مرتبة حيث يتم حجز مكان في النص للقيم التي تم تخزينها سابقاً في متغيرات.

name = 'Mhamad'            # قمنا بتخزين قيمة نصية name في المتغير
money = 10                 # قمنا بتخزين قيمة عددية money في المتغير
subject = 'programming'    # قمنا بتخزين قيمة نصية subject في المتغير
age = 19                   # قمنا بتخزين قيمة عددية age في المتغير

# و الذي ننوي عرضه مكانه name لحجز مكان للنص الموجود في المتغير %s هنا قمنا باستخدام الرمز
print('Hello my name is %s.' %(name))

# و الذي ننوي عرضه مكانه money لحجز مكان للرقم الموجود في المتغير %d هنا قمنا باستخدام الرمز
print('I have %d dollars.' %(money))

# age لحجز مكان للرقم الموجود في المتغير %d و الرمز subject لحجز مكان للنص الموجود في المتغير %s هنا قمنا باستخدام الرمز
print('I learn %s at %d.' %(subject, age))

# ---------------------------------------------------------------

# 4- العامل in :
# هذا العامل يستخدم لمعرفة ما إن كان النص يحتوي على نص محدد.

s = 'Python is easy to learn.'    # s هنا قمنا بتعريف متغير نصي إسمه

print('easy' in s)                # s موجود في النص المخزن في المتغير 'easy' لأن النص True هنا سيتم طباعة
print('hard' in s)                # s غير موجود في النص المخزن في المتغير 'hard' لأن النص False هنا سيتم طباعة

# ---------------------------------------------------------------

# 5- العامل not in :
# هذا العامل يستخدم لمعرفة ما إن كان النص لا يحتوي على نص محدد.

s = 'Python is easy to learn.'    # s هنا قمنا بتعريف متغير نصي إسمه

print('easy' not in s)            # s موجود في النص المخزن في المتغير 'easy' لأن النص False هنا سيتم طباعة
print('hard' not in s)            # s غير موجود في النص المخزن في المتغير 'hard' لأن النص True هنا سيتم طباعة

# ---------------------------------------------------------------

# ==================================================================================================================================================
