# ----------------------------------------------------------------------------------------------------------------------------------

# الشروط :

#---------------------------------------------------------------

# 1- جملة الشرط if تُستخدم لتنفيذ كود معين إذا تحقق الشرط الموضوع فيها.

age = 20

# أكبر أو تساوي 18 فإنه سيتم تنفيذ الأمر الموجود فيها age هذا الشرط يعني أنه إذا كانت قيمة
if age >= 18:
    print('You are allowed.')

#---------------------------------------------------------------

# 2- جملة الشرط else تُستخدم لتنفيذ كود معين في حال لم تتنفذ أي جملة شرطية موضوعة قبلها و لهذا السبب توضع في الآخر.

is_logged = True

# فإنه سيتم تنفيذ الأمر الموجود فيها true تساوي isLogged هذا الشرط يعني أنه إذا كانت قيمة
if is_logged:
    print('You can save your progress.')

# إذا لم يتم تنفيذ الجملة الشرطية السابقة فإنه سيتم تنفيذ أمر الطباعة الموجود هنا
else:
    print('You need to log in to save your progress.')

#---------------------------------------------------------------

# 3- جملة الشرط elif تُستخدم لوضع أكثر من شرط بحيث يكون هناك أكثر من إحتمال.جملة أو جمل الشرط elif يوضعون في الوسط بعد الجملة if و قبل الجملة else.

role = 'author'

# فإنه سيتم تنفيذ أمر الطباعة الموجود هنا 'admin' تساوي role إذا كانت قيمة
if role == 'admin':
    print('You logged in as an admin.')
    
# فإنه سيتم تنفيذ أمر الطباعة الموجود هنا 'editor' تساوي role إذا كانت قيمة
elif role == 'editor':
    print('You logged in as an editor.')

# فإنه سيتم تنفيذ أمر الطباعة الموجود هنا 'author' تساوي role إذا كانت قيمة
elif role == 'author':
    print('You logged in as an author.')

# فإنه سيتم تنفيذ أمر الطباعة الموجود هنا 'contributer' تساوي role إذا كانت قيمة
elif role == 'contributer':
    print('You logged in as a contributer.')

# إذا لم يتم تنفيذ الجملة الشرطية السابقة فإنه سيتم تنفيذ أمر الطباعة الموجود هنا
else:
    print('You logged in as a subscriber.')

#---------------------------------------------------------------

# ----------------------------------------------------------------------------------------------------------------------------------

# وضع أكثر من شرط في الجملة if

# العامل and يستخدم في حال كنت تريد تنفيذ كود معين إذا كان جواب جميع الشروط الموضوعة يساوي True.

# العامل or يستخدم في حال كنت تريد تنفيذ كود معين إذا كان جواب شرط واحد على الأقل يساوي True.

# المثال الأول : 

n = 14;

# أكبر أو تساوي 0 و بذات الوقت أصغر أو تساوي 20 سيتم تنفيذ أمر الطباعة n إذا كانت قيمة
if n >= 0 and n <= 20:
    print(n, "is accepted.")

# else سيتم تنفيذ أمر الطباعة الموضوع في الجملة الشرطية if إذا لم تتنفذ الجملة الشرطية
else:
    print(n, "is not accepted!")

# المثال الثاني :

x = 2

# تساوي 1 أو 2 أو 3 سيتم تنفيذ أمر الطباعة x إذا كانت قيمة
if x == 1 or x == 2 or x == 3:
    print(x, "is available.")

# else سيتم تنفيذ أمر الطباعة الموضوع في الجملة الشرطية if إذا لم تتنفذ الجملة الشرطية
else:
    print(x, "is not available!")

#---------------------------------------------------------------

# ----------------------------------------------------------------------------------------------------------------------------------
